# mac apps
cask "obsidian"
cask "raycast"
cask "discord"
cask "brave-browser"
cask "spotify"
cask "obs"
cask "slack"
cask "telegram"

# terminal
cask "ghostty"
cask "font-jetbrains-mono"
brew "neovim"
brew "starship"
brew "ripgrep"
brew "luarocks"
brew "fzf"
brew "zsh-autosuggestions"
brew "lazygit"
brew "btop"
brew "bat"
brew "yazi"
cask "font-jetbrains-mono"

# dev
brew "golang"
brew "node"
brew "protobuf"
brew "git"
brew "git-lfs"
brew "pgformatter"
brew "sst/tap/opencode"
brew "hugo"
brew "gh"

# containers
cask "orbstack"
brew "docker"
brew "kubectl"
brew "k9s"
brew "lazydocker"
cask "google-cloud-sdk"
