# mac apps
cask "obsidian"
cask "raycast"
cask "discord"
cask "obs"
cask "slack"
cask "notion"
brew "tw93/tap/mole"

# terminal
cask "ghostty"
cask "font-jetbrains-mono"
brew "neovim"
brew "starship"
brew "ripgrep"
brew "luarocks"
brew "fzf"
brew "zsh-autosuggestions"
brew "lazygit"
brew "btop"
brew "bat"
brew "yazi"
brew "fd"

# dev
brew "golang"
brew "protobuf"
brew "git"
brew "git-lfs"
brew "pgformatter"
brew "hugo"
brew "gh"
brew "openjdk"
brew "pnpm"
brew "oxfmt"
cask "zed"
brew "postgresql@17"
brew "redis"

# containers
cask "orbstack"
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "k9s"
brew "lazydocker"
brew "colima"
brew "qemu"

# llm
cask "claude-code"
brew "anomalyco/tap/opencode"
brew "rtk"
