tap "jesseduffield/lazydocker"
tap "derailed/k9s"

# Packages
brew "neovim"
brew "ripgrep"
brew "luarocks"
brew "protobuf"
brew "stylua"
brew "shfmt"
brew "shellcheck"
brew "golang"
brew "golangci-lint"
brew "sqlc"
brew "vegeta"
brew "yaml-language-server"
brew "prettier"
brew "git"
brew "git-lfs"
brew "zig"
brew "fzf"
brew "colima"
brew "qemu"
brew "docker"
brew "kubectl"
brew "helm"
brew "kube-linter"
brew "kubescape"
brew "k9s"
brew "lazydocker"
brew "btop"
brew "fastfetch"
brew "bat"

# Casks
cask "google-cloud-sdk" 

